{
  "id": "ancient_door",
  "name": "The Buried Door",
  "description": "Half-buried in the earth and overgrown with moss, a stone door stands here, its surface covered in runes that seem to shift when you look away. The door is clearly ancient, older than the village, older than memory. It doesn't open—not yet, perhaps not ever by ordinary means. But its presence here is significant, a marker of something important that lies beyond current understanding. The runes whisper of forgotten ages and paths not yet taken.",
  "descriptions_by_time": {
    "dawn": "The ancient door stands half-buried in the earth, its runes barely visible in the pale morning light. The moss that covers it is dark and wet with dew, and the door seems to shift in the dimness. It's clearly ancient, older than the village, older than memory. The runes whisper of forgotten ages and paths not yet taken, their meaning lost in the morning mist.",
    "day": "Half-buried in the earth and overgrown with moss, a stone door stands here, its surface covered in runes that seem to shift when you look away. The door is clearly ancient, older than the village, older than memory. It doesn't open—not yet, perhaps not ever by ordinary means. But its presence here is significant, a marker of something important that lies beyond current understanding. The runes whisper of forgotten ages and paths not yet taken.",
    "dusk": "As evening approaches, the ancient door takes on a more ominous feel. The runes seem to shift more in the fading light, and the moss is dark and shadowed. The door is clearly ancient, older than the village, older than memory. The runes whisper of forgotten ages and paths not yet taken, their meaning more urgent in the twilight.",
    "night": "In the pitch dark, the ancient door is truly mysterious. The runes are barely visible, just dark patterns against the stone, and they seem to shift constantly in the darkness. The moss is invisible, and the door is just a dark shape against the blackness. It's clearly ancient, older than the village, older than memory. The runes whisper of forgotten ages and paths not yet taken, and you can't shake the feeling that something is watching from beyond the door. The darkness makes it feel more powerful, more dangerous."
  },
  "exits": {
    "west": "whispering_trees"
  },
  "items": [],
  "npcs": [],
  "outdoor": true,
  "features": ["forest", "stone"],
  "details": {
    "door": {
      "name": "door",
      "aliases": ["door", "stone door", "ancient door", "buried door"],
      "description": "Half-buried in the earth and overgrown with moss, a stone door stands here, its surface covered in runes that seem to shift when you look away. The door is clearly ancient, older than the village, older than memory. It doesn't open—not yet, perhaps not ever by ordinary means.",
      "stat": {
        "type": "fixture",
        "material": "stone",
        "condition": "ancient, sealed"
      }
    },
    "runes": {
      "name": "runes",
      "aliases": ["rune", "runes", "markings"],
      "description": "Runes cover the surface of the door, their patterns seeming to shift when you look away. They whisper of forgotten ages and paths not yet taken, their meaning lost to time but their power still palpable.",
      "stat": {
        "type": "fixture",
        "material": "stone",
        "condition": "ancient, mysterious"
      }
    },
    "moss": {
      "name": "moss",
      "aliases": ["moss", "overgrowth"],
      "description": "Moss grows thick over the door, covering it in a green blanket that speaks of long years of neglect. Yet the door itself remains intact beneath, as if waiting for something.",
      "stat": {
        "type": "fixture",
        "material": "organic",
        "condition": "thick, overgrown"
      }
    }
  }
}

