{
  "id": "shrine_of_the_forgotten",
  "name": "Shrine of the Forgotten Path",
  "description": "A small stone shrine stands here, its carvings worn smooth by time and weather. The patterns etched into the stone are ancient, their meaning lost to most, but they seem to hum with a subtle energy. There's something mysterious about this place—a sense of deep history and forgotten knowledge. The air feels different here, as if the boundary between the mundane and something more is thinner. This is a place of quiet power, waiting to be understood.",
  "descriptions_by_time": {
    "dawn": "The shrine stands in the pale morning light, its carvings barely visible in the dimness. The patterns etched into the stone seem to shift in the early light, their meaning still lost. The air feels different here, as if the boundary between the mundane and something more is thinner at dawn. This is a place of quiet power, waiting to be understood.",
    "day": "A small stone shrine stands here, its carvings worn smooth by time and weather. The patterns etched into the stone are ancient, their meaning lost to most, but they seem to hum with a subtle energy. There's something mysterious about this place—a sense of deep history and forgotten knowledge. The air feels different here, as if the boundary between the mundane and something more is thinner. This is a place of quiet power, waiting to be understood.",
    "dusk": "As evening approaches, the shrine takes on a golden glow. The carvings seem to catch the last rays of sunlight, their patterns more visible now. The air feels different here, as if the boundary between the mundane and something more is thinner at dusk. This is a place of quiet power, waiting to be understood.",
    "night": "In the darkness, the shrine is truly mysterious. The carvings are barely visible, just dark patterns against the stone. The air feels different here, as if the boundary between the mundane and something more is thinnest at night. The shrine seems to hum with a subtle energy, and you can't shake the feeling that something ancient is watching. This is a place of quiet power, waiting to be understood."
  },
  "exits": {
    "north": "market_lane"
  },
  "items": ["smooth_rune_stone"],
  "npcs": ["quiet_acolyte"],
  "outdoor": true,
  "features": ["shrine", "stone"],
  "details": {
    "shrine": {
      "name": "shrine",
      "aliases": ["shrine", "stone shrine", "altar"],
      "description": "A small stone shrine stands here, its carvings worn smooth by time and weather. The patterns etched into the stone are ancient, their meaning lost to most, but they seem to hum with a subtle energy. There's something mysterious about this place—a sense of deep history and forgotten knowledge.",
      "stat": {
        "type": "fixture",
        "material": "stone",
        "condition": "ancient, weathered"
      }
    },
    "carvings": {
      "name": "carvings",
      "aliases": ["carving", "carvings", "runes", "patterns"],
      "description": "Ancient patterns are etched into the stone, worn smooth by time and weather. They seem to shift when you look away, as if holding secrets that refuse to be fully understood. The carvings hum with a subtle energy.",
      "stat": {
        "type": "fixture",
        "material": "stone",
        "condition": "ancient, mysterious"
      }
    }
  }
}

