{
  "id": "town_square",
  "name": "Hollowvale Town Square",
  "description": "You stand in the heart of Hollowvale, a cozy frontier square where cracked cobblestones circle an old fountain. The water still flows, though the basin is weathered with age. A notice board stands to one side, its parchment fluttering in the breeze. To the north, a rocky path leads up toward the watchtower that overlooks the valley. The square feels familiar and safe, yet there's a sense that this place has seen many stories.",
  "exits": {
    "north": "watchtower_path",
    "south": "tavern",
    "east": "market_lane",
    "west": "forest_edge"
  },
  "items": ["copper_coin"],
  "npcs": ["old_storyteller"],
  "outdoor": true,
  "features": ["village", "fountain", "cobblestones"],
  "details": {
    "cobblestones": {
      "name": "cobblestones",
      "aliases": ["cobblestone", "cobblestones", "stones", "stone"],
      "description": "The cobblestones beneath your feet are cracked and weathered, worn smooth by countless footsteps over the years. They circle the old fountain, forming a rough pattern that speaks of the square's long history.",
      "stat": {
        "type": "fixture",
        "material": "stone",
        "condition": "weathered"
      }
    },
    "fountain": {
      "name": "fountain",
      "aliases": ["fountain", "old fountain"],
      "description": "An old fountain stands at the center of the square, its basin weathered with age. Despite its years, water still flows from it, clear and fresh. The stonework shows signs of careful maintenance, suggesting the villagers still value this landmark.",
      "stat": {
        "type": "fixture",
        "material": "stone",
        "condition": "weathered but functional"
      }
    },
    "notice_board": {
      "name": "notice board",
      "aliases": ["notice board", "board", "noticeboard", "bulletin board"],
      "description": "A weathered notice board stands to one side of the square, its surface covered with parchment that flutters in the breeze. Various notices and announcements are pinned to it, some fresh, others yellowed with age.",
      "stat": {
        "type": "fixture",
        "material": "wood",
        "condition": "weathered"
      }
    },
    "watchtower": {
      "name": "watchtower",
      "aliases": ["watchtower", "tower"],
      "description": "To the north, a watchtower overlooks the valley. It stands as a sentinel, watching over Hollowvale and the lands beyond. The path leading up to it is rocky but well-traveled.",
      "stat": {
        "type": "fixture",
        "material": "stone",
        "condition": "maintained"
      }
    }
  }
}

